#include "ofApp.h"

//--------------------------------------------------------------
void ofApp::setup(){
	// ofBackground(Rの値, Gの値, Bの値);
	ofBackground(31, 31, 31); // 背景色の設定
	// ofSetColor(Rの値, Gの値, Bの値);
	ofSetColor(242, 204, 47); // 描画色の設定
}

//--------------------------------------------------------------
void ofApp::update(){

}

//--------------------------------------------------------------
void ofApp::draw(){
	// ofLine(始点のx座標, 始点のy座標, 終点のx座標, 終点のy座標);
	ofLine(100, 300, 800, 500); // 直線を描く
	// ofRect(左上のx座標, 左上のy座標, 幅, 高さ);
	ofRect(200, 250, 150, 200); // 四角形を
	// ofCircle(中心点のx座標, 中心点のy座標, 半径);
	ofCircle(450, 300, 60); // 円形を描く
	// ofEllipse(中心点のx座標, 中心点のy座標, 幅, 高さ);
	ofEllipse(550, 500, 200, 100); // 楕円形を描く
	// ofTriangle(点1のx座標, 点1のy座標, 点2のx座標, 点2のy座標, 点3のx座標, 点3のy座標);
	ofTriangle(700, 200, 550, 400, 750, 300); // 三角形を描く
}

//--------------------------------------------------------------
void ofApp::keyPressed(int key){

}

//--------------------------------------------------------------
void ofApp::keyReleased(int key){

}

//--------------------------------------------------------------
void ofApp::mouseMoved(int x, int y ){

}

//--------------------------------------------------------------
void ofApp::mouseDragged(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mousePressed(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mouseReleased(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mouseEntered(int x, int y){

}

//--------------------------------------------------------------
void ofApp::mouseExited(int x, int y){

}

//--------------------------------------------------------------
void ofApp::windowResized(int w, int h){

}

//--------------------------------------------------------------
void ofApp::gotMessage(ofMessage msg){

}

//--------------------------------------------------------------
void ofApp::dragEvent(ofDragInfo dragInfo){ 

}
